FKDD_COPY_DIFF_3_2026-02-14/Enums/ns_ПравилаСкидокНаценок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ns_ПравилаСкидокНаценок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЦенаБольше</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Catalogs/ns_СкидкиНаценки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ns_СкидкиНаценки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Правила</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Правило</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ns_ПравилаСкидокНаценок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПроверки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/CommonModules/ns_Ценообразование/Ext/Module.bsl
Функция ПолучитьТаблицуЦенНоменклатуры(Номенклатура) Экспорт
	ТаблицаЦен = ns_Переопределяемый.ПолучитьТаблицуЦенНоменклатуры(Номенклатура);
	
	Правила = ПолучитьПравилаСкидокНаценок();
	Если НЕ Правила = Неопределено Тогда
		ПреобразоватьЦеныПоПравилам(ТаблицаЦен, Правила);	
	КонецЕсли;
	
	Возврат ТаблицаЦен;
КонецФункции

Функция ПолучитьПравилаСкидокНаценок()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ns_СкидкиНаценкиПравила.Правило КАК Правило,
	|	ns_СкидкиНаценкиПравила.ЗначениеПроверки КАК ЗначениеПроверки,
	|	ns_СкидкиНаценкиПравила.Размер КАК Размер
	|ИЗ
	|	Справочник.ns_СкидкиНаценки.Правила КАК ns_СкидкиНаценкиПравила
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗначениеПроверки УБЫВ";
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	Возврат РезультатЗапроса.Выгрузить();
КонецФункции

Процедура ПреобразоватьЦеныПоПравилам(ТаблицаЦен, Правила)
	
	Для каждого СтрЦена Из ТаблицаЦен Цикл
		Скидка = 0;
		Для каждого СтрПравило Из Правила Цикл
			Если СтрПравило.Правило = Перечисления.ns_ПравилаСкидокНаценок.ЦенаБольше Тогда
				Если СтрЦена.Значение > СтрПравило.ЗначениеПроверки Тогда
					Скидка = СтрПравило.Размер;
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если Скидка > 0 Тогда
			ЦенаСоСкидкой = СтрЦена.Значение - (СтрЦена.Значение/100 * Скидка);
			ТаблицаЦен[СтрЦена.Ключ] = Окр(ЦенаСоСкидкой);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
